package lab30;

/*сли класс реализует два интерфейса с одинаковыми неабстрактными методами, возникает конфликт реализаций:
компилятор не может определить, какой метод выбрать, и выдаёт ошибку. Чтобы устранить конфликт, класс обязан переопределить этот метод
и либо выбрать реализацию одного из интерфейсов, либо определить собственную версию метода. */

// Первый интерфейс
interface A {
    default void hello() {
        System.out.println("Привет из A");
    }
}

// Второй интерфейс
interface B {
    default void hello() {
        System.out.println("Привет из B");
    }
}

// Класс реализует оба интерфейса - возникает конфликт
class MyClass implements A, B {

    // Обязательное переопределение
    @Override
    public void hello() {
        // Можно выбрать, какой default-метод вызвать:
        A.super.hello();   // Вариант 1 — вызвать метод из A
        // B.super.hello(); // Вариант 2 — вызвать метод из B

        // Или написать свой вариант:
        // System.out.println("Мой собственный метод");
    }
}

public class pr2 {
    public static void main(String[] args) {
        MyClass obj = new MyClass();
        obj.hello();
    }
}
